#+title: Enabling Distributed Spatial Audio
#+subtitle: Thesis Committee --- Year 2
#+author: Thomas Rushton

#+options: num:nil toc:nil
#+options: reveal_width:1500 reveal_height:1000 reveal_slide_number:c/t
#+export_file_name: index
#+property: header-args:css :results none :exports none :tangle ./style.css
#+reveal_root: ../reveal.js
#+reveal_theme: white_contrast_compact_verbatim_headers
#+reveal_trans: slide
#+reveal_plugins: (math)
#+reveal_extra_css: style.css
#+reveal_min_scale: 1.0
#+reveal_max_scale: 1.0
#+reveal_extra_options: hash: true, fragmentInURL: true
#+reveal_title_slide: <h1>%t</h1><h2>%s</h2><h3>%a</h3>
#+reveal_title_slide_background: #141414
#+reveal_title_slide_extra_attr: class="title-slide"

** Precision Time Protocol
:PROPERTIES:
:reveal_extra_attr: data-auto-animate
:END:

#+begin_src emacs-lisp :exports none
(let* ((t1 0)
       (t2 1251)
       (t3 592727)
       (t4 593569)
       (t11 998936898)
       (t22 998938145)
       (deltat1 (- t11 t1))
       (deltat2 (- t22 t2))
       (drift (- 1 (/ (float deltat2) (float deltat1))))
       (delay (/ (- (- t4 t1) (- t3 t2)) 2.0))
       (offset (- t2 t1 delay)))
  (format "delta t1 %d\ndelta t2 %d\ndrift %.9f\ndelay %.9f\noffset %.9f"
          deltat1 deltat2 drift delay offset))
#+end_src

#+RESULTS:
#+begin_example
delta t1 998936898
delta t2 998936894
drift 0.000000004
delay 1046.500000000
offset 204.500000000
#+end_example

#+attr_html: :style font-size: .6em
| Clock Authority |                                           |                                             | Clock Subscriber |
| Message         | Action                                    | Action                                      | Message          |
|-----------------+-------------------------------------------+---------------------------------------------+------------------|
| Sync (Tx)       | Set \(\color{red} {t_{1}=0}\) ns             |                                             |                  |
| FollowUp (Tx)   | Transmit \(\color{red}{t_{1}}\)              |                                             |                  |
|                 |                                           | Set \(\color{green}{t_{2}=1\,251}\) ns         | Sync (Rx)        |
|                 |                                           | Receive \(\color{red}{t_{1}}\)                 | FollowUp (Rx)    |
|                 |                                           | Set \(\color{green}{t_{3}=592\,727}\) ns       | DelayReq (Tx)    |
| DelayReq (Rx)   | Set \(\color{red}{t_{4}=593\,569}\) ns       |                                             |                  |
| DelayResp (Tx)  | Transmit \(\color{red}{t_{4}}\)              |                                             |                  |
|                 |                                           | Receive \(\color{red}{t_{4}}\)                 | DelayResp (Rx)   |
| Sync (Tx)       | Set \(\color{red}{t'_{1}=998\,936\,898}\) ns |                                             |                  |
| FollowUp (Tx)   | Transmit \(\color{red}{t'_{1}}\)             |                                             |                  |
|                 |                                           | Set \(\color{green}{t'_{2}=998\,938\,145}\) ns | Sync (Rx)        |
|                 |                                           | Receive \(\color{red}{t'_{1}}\)                | FollowUp (Rx)    |

#+ATTR_REVEAL: :frag t
#+attr_html: :style font-size: .7em
\begin{gather}
\text{Drift} = 1 - \frac{\color{green}{t_{2}'}-\color{green}{t_{2}}}
  {\color{red}{t_{1}'}-\color{red}{t_{1}}} = 4\;\text{ns} \\[5pt]
\text{Delay} = \frac{(\color{red}{t_{4}} - \color{red}{t_{1}}) -
  (\color{green}{t_{3}} - \color{green}{t_{2}}) }{2} = 1046\;\text{ns} \\[5pt]
\text{Offset} = \color{green}{t_{2}} - \color{red}{t_{1}} - \text{Delay} = 204\;\text{ns}
\end{gather}

** Time Exchange \to Sampling Frequency Exchange
:PROPERTIES:
:reveal_extra_attr: data-auto-animate
:END:

\(\mathrm{Adjust}\;\) nanoseconds \(\to a\;\) seconds

#+ATTR_REVEAL: :frag t
\begin{equation}
\hat{F}_{s} = F_{s}\left(1 + a\right)
\end{equation}

#+ATTR_REVEAL: :frag t
E.g. running fast, \(\mathrm{Adjust} = -124\,\mathrm{ns},\;a =
-1.24\times10^{-7}\,\mathrm{s}\)

#+begin_src emacs-lisp :exports none
(let* ((adjust -124)
       (fs 48e3)       
       (nsps 1e9)
       (drift (* adjust (/ 1 nsps)))
       (ratio (+ 1 drift))
       (newfs (* fs ratio))
       (frac-diff (/ 1. (- newfs fs))))
  (format "Ratio: %.9f, new fs: %.9f Hz, fractional diff: 1/%.1f Hz"
          ratio newfs frac-diff))
#+end_src

#+RESULTS:
#+begin_example
Ratio: 0.999999876, new fs: 47999.994048000 Hz, fractional diff: 1/-168.0 Hz
#+end_example

#+ATTR_REVEAL: :frag t
\begin{align}
\hat{F}_{s} &= 48\,000\left(1 - 1.24\times10^{-7}\right) \\
  &= 48\,000 \times 0.999\,999\,876 \\
  &= 47\,999.994\,048\;\mathrm{Hz}
\end{align}

** Time Exchange \to Sampling Frequency Exchange
:PROPERTIES:
:reveal_extra_attr: data-auto-animate
:END:

\begin{equation}
\hat{F}_{s} = \frac{24\times10^{6}}{2^{8}}\frac{D_{S}+\frac{D_{N}}{D_{D}}}{D_{p}D_{A}D_{I_{1}}D_{I_{2}}}
\end{equation}

#+ATTR_REVEAL: :frag t
\begin{equation}
D_{N} = D_{D}\left(\frac{2^{8}\hat{F}_{s}D_{p}D_{A}D_{I_{1}}D_{I_{2}}}{24\times10^{6}} - D_{S}\right)
\end{equation}

#+begin_src emacs-lisp :exports none
(* 1e9
   (- (/ (* (lsh 1 8) 3 19 47999.994048)
         24e6)
      29.0))
#+end_src

#+RESULTS:
#+begin_example
183996381.1840022
#+end_example

#+ATTR_REVEAL: :frag t
#+attr_html: :style margin-top: 2em
\(\hat{F}_{s} = 48\,000\quad\to\quad D_{N} = 184\,000\,000\)

#+ATTR_REVEAL: :frag t
#+attr_html: :style margin-top: 2em
\(\hat{F}_{s} = 47\,999.994\,048\quad\to\quad D_{N} \approx 183\,996\,381\)

** Frame-Synchronous Output
:PROPERTIES:
:reveal_extra_attr: data-auto-animate
:END:

Problem: Sampling rate parity \(\neq\) synchronous output

#+ATTR_REVEAL: :frag t
Solution: Start clock subscriber audio subsystem when PTP lock
achieved

#+ATTR_REVEAL: :frag t
Takes  ~10 seconds from boot for <100 ns offset

#+ATTR_REVEAL: :frag t
Works for nominal \(F_{s}\) that is an integer multiple of the buffer
size

#+begin_src emacs-lisp :exports none
(format "44.1/128: %f; 48/128: %f" (/ 44100.0 128) (/ 48000.0 128))
#+end_src

#+RESULTS:
#+begin_example
44.1/128: 344.531250; 48/128: 375.000000
#+end_example

#+ATTR_REVEAL: :frag t
\begin{gather}
\frac{44\,100}{128} = 344.531\,25 \\[1em]
\frac{48\,000}{128} = 375
\end{gather}

